IDEA Open Model
ResultOfInternalForces2 Properties
Compatible with IDEA StatiCa Beta 20.0
The ResultOfInternalForces2 type exposes the following members.
Properties
Name | Description
Loading
 LoadingTypeClass
Mx
 Bending moment around x-axis
My
 Bending moment around y-axis
Mz
 Bending moment around z-axis
N
 Normal force
Qy
 Shear force in y dirrection
Qz
 Shear force in z dirrection
Top
See Also
Reference
ResultOfInternalForces2 Class
IdeaRS.OpenModel.Result Namespace